def pendulum(lst: list) -> list:
    result = []
    sort_lst = sorted(lst)
    for i in range(len(sort_lst)):
        if i % 2:
            result.append(sort_lst[i])
        else:
            result.insert(0, sort_lst[i])

    return result

print(pendulum([6, 6, 8, 5, 10]))  # повертає [10, 6, 5, 6, 8]
# Оскільки 5 є найменшим елементом списку,
# він потрапляє у центральну позицію списку.
# Більший, ніж найменший елемент дорівнює 6 і йде праворуч від 5.
# Наступний більший елемент йде ліворуч від мінімального числа тощо.
# Пам'ятай, дублікати враховуються при розміщенні, не видаляй їх.
print(pendulum([-9, -2, -10, -6]))  # повертає [-6, -10, -9, -2]
